"""
假设给出一个数值9876543201，直接看这个数字很难直观准确读出来，为了快速读出一个数字，请编写一个读数系统。
中文读数规则：
1. 从高位读起，先读亿级，再读万级，最后读个级；
2. 读亿级和万级时按读个级的方法来读，读完亿级后加上一个‘亿’字，读完万级后加上一个‘万’字
3. 每级末尾不管有多少个0都不读

输入一个小于一百亿的正整数n（1<=n<10000000000），按照中文读写的规范转为汉语拼音字符串

例如：
给定一个阿拉伯数字串‘9876543201’
中文读写规范：九十八亿七千六百五十四万三千二百零一
"""
import re

num_dict = {'1': '一', '2': '二', '3': '三', '4': '四', '5': '五', '6': '六', '7': '七', '8': '八', '9': '九', '0': '零', }
index_dict = {1: '', 2: '十', 3: '百', 4: '千', 5: '万', 6: '十', 7: '百', 8: '千', 9: '亿', 10: '十亿'}
num = input(">>")
# num = '9876543201'
nums = list(num)
nums_index = [x for x in range(1, len(nums) + 1)][-1::-1]
str = ''
for index, item in enumerate(nums):
    str = "".join((str, num_dict[item], index_dict[nums_index[index]]))

str = re.sub("零[十百千零]*", "零", str)
str = re.sub("零万", "万", str)
str = re.sub("亿万", "亿零", str)
str = re.sub("零零", "零", str)
str = re.sub("零\\b", "", str)
print(str)